Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РешенияКлиентовПоЗначениямЭСП</xr:Item>
				<xr:Item>InformationRegister.АналогиЦенныхБумаг</xr:Item>
				<xr:Item>InformationRegister.ЗначенияНастроекУчетаЦенныхБумаг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭффективнаяПроцентнаяСтавка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Аналоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелиИспользованияАналогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиУчетаЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НастройкиУчетаЦенныхБумаг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/РегистрацияПредоставленныхКлиентомСведенийОЦенныхБумагах/Ext/ManagerModule.bsl
Функция ПолучитьСчетаДУИзПартийТабличнойЧасти(ПартииТабличнойЧасти)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьЭСП.Партия КАК Партия
		|ПОМЕСТИТЬ _ТабличнаяЧастьЭСП
		|ИЗ
		|	&ТабличнаяЧастьЭСП КАК ТабличнаяЧастьЭСП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ТабличнаяЧастьЭСП.Партия.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	_ТабличнаяЧастьЭСП КАК _ТабличнаяЧастьЭСП");
	
	Запрос.УстановитьПараметр("ТабличнаяЧастьЭСП", ПартииТабличнойЧасти);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");

КонецФункции

Функция ПолучитьСчетаДУИзОстатковБумаг(Документ)

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ИмяВременнойТаблицыЦенныхБумагКлиента = РаботаСЦеннымиБумагами.ПолучитьЦенныеБумагиКлиента(Документ.Клиент, Документ.Организация, КонецДня(Документ.Дата),,, Истина, Истина,, МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ЦенныеБумагиКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	&ЦенныеБумагиКлиента КАК _ЦенныеБумагиКлиента
		|ГДЕ
		|	_ЦенныеБумагиКлиента.ЦеннаяБумага = &ЦеннаяБумага");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЦенныеБумагиКлиента", ИмяВременнойТаблицыЦенныхБумагКлиента);
	
	Запрос.УстановитьПараметр("ЦеннаяБумага", Документ.ЦеннаяБумага);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления");

КонецФункции

Функция ПолучитьСвязанныеСчетаДоверительногоУправления(Документ) Экспорт

	СвязанныеСчетаДоверительногоУправления = Новый Массив;
	
	Если ТипЗнч(Документ.Клиент) = Тип("СправочникСсылка.СчетаДоверительногоУправления")		// т.к. документ создан по счету ДУ, то его и вернем
		И Документ.Клиент <> Справочники.СчетаДоверительногоУправления.ПустаяСсылка() Тогда 
		
		СвязанныеСчетаДоверительногоУправления.Добавить(Документ.Клиент);
		
		Возврат	СвязанныеСчетаДоверительногоУправления;
	
	КонецЕсли;
	
	// Для Аналогов получаем счета клиента, у которых на остатках есть эта бумага
	Если ЗначениеЗаполнено(Документ.Аналоги) Тогда
		
		Возврат ПолучитьСчетаДУИзОстатковБумаг(Документ); // т.к. мы получаем ВСЕ счета ДУ, где есть бумага, дальше можно не проверять
		
	КонецЕсли;

	// Настройки учета могут быть как на всю бумагу (партии не заданы), так и на конкретные партии
	// если ВСЕ настройки заданы на партии, то берем счет ДУ из партий
	// если есть хоть 1 настройка, заданная на всю бумагу, то поступаем аналогично аналогам - берем все счета, на которых есть бумага
	Если ЗначениеЗаполнено(Документ.НастройкиУчета) Тогда
		
		ЗаданыПартииДляКаждойНастойки = Истина;
		Для каждого СтрокаНастройкиУчета Из Документ.НастройкиУчета Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаНастройкиУчета.Партия) Тогда
				ЗаданыПартииДляКаждойНастойки = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЗаданыПартииДляКаждойНастойки Тогда
		
			РаботаСКоллекциями.ДополнитьМассив(
				СвязанныеСчетаДоверительногоУправления,
				ПолучитьСчетаДУИзПартийТабличнойЧасти(Документ.НастройкиУчета.Выгрузить(, "Партия")),
				Истина);
				
		Иначе
			
			Возврат ПолучитьСчетаДУИзОстатковБумаг(Документ); // т.к. мы получаем ВСЕ счета ДУ, где есть бумага, дальше можно не проверять
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Для ЭСП получаем из партий - они всегда заданы в ТЧ
	Если ЗначениеЗаполнено(Документ.ЭСП) Тогда
		
		РаботаСКоллекциями.ДополнитьМассив(
			СвязанныеСчетаДоверительногоУправления,
			ПолучитьСчетаДУИзПартийТабличнойЧасти(Документ.ЭСП.Выгрузить(, "Партия")),
			Истина);
		
	КонецЕсли;
	
	Возврат СвязанныеСчетаДоверительногоУправления;
	
КонецФункции

Функция ТипыОфертТребующиеПересчетаЭСП() Экспорт 

	ТипыОферт = Новый Массив();
	ТипыОферт.Добавить(Перечисления.ТипыОфертПоОблигациям.Досрочно);
	ТипыОферт.Добавить(Перечисления.ТипыОфертПоОблигациям.ОфертаПродажа);

	Возврат ТипыОферт;
	
КонецФункции

Функция ПартииПоАСиРегистрациейЭСП(Дата, ЦеннаяБумага, Организация, Клиент = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	(&ВсеКлиенты
		|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.Клиент = &Клиент
		|			ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = &Клиент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ _Партии
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СчетаДУ.СчетДоверительногоУправления
		|					ИЗ
		|						_СчетаДУ)
		|				И УчетныйАктивЕПС.ВключатьРасходыПоПокупкеВСтоимость) КАК БухПартииЦенныхБумагОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Партии.Партия КАК Партия,
		|	_Партии.СтрокаПартии КАК СтрокаПартии,
		|	РешенияКлиентовПоЗначениямЭСПСрезПоследних.Период КАК Период,
		|	РешенияКлиентовПоЗначениямЭСПСрезПоследних.ЭСП КАК ЭСП
		|ПОМЕСТИТЬ _Решения
		|ИЗ
		|	_Партии КАК _Партии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РешенияКлиентовПоЗначениямЭСП.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|					И ЦеннаяБумага = &ЦеннаяБумага
		|					И ДатаНачалаДействия < &Период
		|					И СчетДоверительногоУправления В
		|						(ВЫБРАТЬ
		|							_СчетаДУ.СчетДоверительногоУправления
		|						ИЗ
		|							_СчетаДУ)) КАК РешенияКлиентовПоЗначениямЭСПСрезПоследних
		|		ПО _Партии.Партия = РешенияКлиентовПоЗначениямЭСПСрезПоследних.Партия
		|			И _Партии.СтрокаПартии = РешенияКлиентовПоЗначениямЭСПСрезПоследних.СтрокаПартии
		|			И (РешенияКлиентовПоЗначениямЭСПСрезПоследних.Используется)
		|			И (РешенияКлиентовПоЗначениямЭСПСрезПоследних.ЭСП <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Решения.Партия КАК Партия,
		|	_Решения.СтрокаПартии КАК СтрокаПартии,
		|	МАКСИМУМ(_Решения.Период) КАК Период
		|ПОМЕСТИТЬ _ПериодРешения
		|ИЗ
		|	_Решения КАК _Решения
		|
		|СГРУППИРОВАТЬ ПО
		|	_Решения.Партия,
		|	_Решения.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Партии.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Партии.Партия КАК Партия,
		|	_Партии.СтрокаПартии КАК СтрокаПартии,
		|	_Партии.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_Решения.ЭСП КАК ЭСП,
		|	_Партии.Количество КАК Количество,
		|	_СчетаДУ.Клиент КАК Клиент
		|ИЗ
		|	_Партии КАК _Партии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДУ КАК _СчетаДУ
		|		ПО _Партии.СчетДоверительногоУправления = _СчетаДУ.СчетДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПериодРешения КАК _ПериодРешения
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Решения КАК _Решения
		|			ПО _ПериодРешения.Партия = _Решения.Партия
		|				И _ПериодРешения.СтрокаПартии = _Решения.СтрокаПартии
		|				И _ПериодРешения.Период = _Решения.Период
		|		ПО _Партии.Партия = _ПериодРешения.Партия
		|			И _Партии.СтрокаПартии = _ПериодРешения.СтрокаПартии
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления,
		|	_Партии.Партия.Дата,
		|	СтрокаПартии";
	
	Если Клиент = Неопределено Тогда
		Запрос.УстановитьПараметр("ВсеКлиенты", Истина);
		Запрос.УстановитьПараметр("Клиент", Справочники.ЮрФизЛица.ПустаяСсылка());
	Иначе		
		Запрос.УстановитьПараметр("ВсеКлиенты", Ложь);
		Запрос.УстановитьПараметр("Клиент", Клиент);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьДенежныйПоток(Организация, Клиент, ЦеннаяБумага, Дата, УчитыватьРешенияКлиентовПоПотокам, УчетныйАктивЕПС = Неопределено, Отказ = Ложь, РасшифровкаРасчета = Неопределено, ДатаОпределенияПотока = Неопределено, Знач СчетДоверительногоУправления = Неопределено) Экспорт
	
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
	
		СчетДоверительногоУправления = Клиент;
	
	ИначеЕсли СчетДоверительногоУправления = Неопределено Тогда
	
		МассивСчетовДУ = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(Клиент, Организация, Дата);
		
		Если МассивСчетовДУ.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У данного клиента нет ни одного действующего договора ДУ", , , , Отказ);
			Возврат Неопределено;
		КонецЕсли;
		
		СчетДоверительногоУправления = МассивСчетовДУ[0]; // берем 1го - настройки должны быть идентичны
		
	КонецЕсли;
	
	
	Партия = Неопределено;
	СтрокаПартии = Неопределено;
	
	Если ТипЗнч(УчитыватьРешенияКлиентовПоПотокам) = Тип("Булево") Тогда
	
		УчитыватьРешенияКлиентов = УчитыватьРешенияКлиентовПоПотокам;
		
	ИначеЕсли ТипЗнч(УчитыватьРешенияКлиентовПоПотокам) = Тип("Структура") Тогда 
		
		Если УчитыватьРешенияКлиентовПоПотокам.Свойство("УчитыватьРешенияКлиентовПоПотокам") Тогда
			УчитыватьРешенияКлиентов = УчитыватьРешенияКлиентовПоПотокам.УчитыватьРешенияКлиентовПоПотокам;
		КонецЕсли;
		УчитыватьРешенияКлиентовПоПотокам.Свойство("Партия", Партия);
		УчитыватьРешенияКлиентовПоПотокам.Свойство("СтрокаПартии", СтрокаПартии);
		
		Если Партия <> Неопределено Тогда // если задана партия, то можно взять счет ду из нее, для большей точности
			СчетДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партия, "СчетДоверительногоУправления");
		КонецЕсли;
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неправильный тип параметра 'Учитывать решения клиентов по потокам'", , , , Отказ);
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиУчетаОбщие			= БухгалтерскийУчет.ОпределитьНастройкиУчета(Дата, Организация, СчетДоверительногоУправления);
	НастройкиУчетаЦеннойБумаги	= БухгалтерскийУчет.ПолучитьОбщиеНастройкиСУчетомНастроекЦеннойБумаги(НастройкиУчетаОбщие, ЦеннаяБумага, УчетныйАктивЕПС, Партия, СтрокаПартии);
	НастройкиЦелиРасчета		= БухгалтерскийУчет.ОпределитьНастройкиЦелиРасчета(Дата, Организация, СчетДоверительногоУправления, Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	
	ПараметрыДенежногоПотока = Новый Структура;
	ПараметрыДенежногоПотока.Вставить("ДоДатыПогашения",					 НастройкиУчетаЦеннойБумаги.РассчитыватьЭСПДо = Перечисления.ВариантыРасчетаДоходностиПоОблигациям.ДоПогашения);
	ПараметрыДенежногоПотока.Вставить("Дата",								 Дата);
	ПараметрыДенежногоПотока.Вставить("ДатаПереоценки",						 ?(ДатаОпределенияПотока = Неопределено, КонецДня(Дата), ДатаОпределенияПотока));
	ПараметрыДенежногоПотока.Вставить("ОбъединятьПотокиПоПериоду",			 Ложь);	
	ПараметрыДенежногоПотока.Вставить("УчитыватьКупонКОферте",				 НастройкиУчетаЦеннойБумаги.УчитыватьКупонКОферте);
	ПараметрыДенежногоПотока.Вставить("НеУчитыватьРешенияКлиентовПоПотокам", НЕ УчитыватьРешенияКлиентов);
	ПараметрыДенежногоПотока.Вставить("ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона", НастройкиУчетаЦеннойБумаги.ПриравниватьДатуОфертыКДатеБлижайшегоПредшествующегоКупона);
	
	ПараметрыОценки = Новый Структура;
	ПараметрыОценки.Вставить("Организация",							Организация);
	ПараметрыОценки.Вставить("Клиент",								Клиент);
	ПараметрыОценки.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиЦелиРасчета.ВариантРасчетаОценочнойСтоимости);
	ПараметрыОценки.Вставить("СчетДоверительногоУправления", 		СчетДоверительногоУправления);
	Если Партия <> Неопределено И СтрокаПартии <> Неопределено Тогда
		ПараметрыОценки.Вставить("Партия", 							Партия);
		ПараметрыОценки.Вставить("СтрокаПартии", 					СтрокаПартии);
	КонецЕсли;
	
	ДенежныйПоток = Справочники.Облигации.ПолучитьДенежныйПоток(ЦеннаяБумага, ПараметрыДенежногоПотока, ПараметрыОценки, Отказ, РасшифровкаРасчета);
	
	Если Отказ Тогда
		
		Возврат Неопределено;	
		
	Иначе	
		
		ДенежныйПоток.Колонки.Дата.Имя	= "ДатаПотока";
		ДенежныйПоток.Колонки.Поток.Имя	= "СуммаПотока";
		
		Возврат ДенежныйПоток;
		
	КонецЕсли;	
	
КонецФункции
